       IDENTIFICATION DIVISION.                      
       PROGRAM-ID. REFPCPT.                          
       ENVIRONMENT DIVISION.                         
       CONFIGURATION SECTION.                        
       SOURCE-COMPUTER. IBM-ZOS.                     
       OBJECT-COMPUTER. IBM-ZOS.                     
       INPUT-OUTPUT SECTION.                         
       FILE-CONTROL.                                 
           SELECT FILECPT ASSIGN TO COMPTE           
              ORGANIZATION IS INDEXED                
              ACCESS MODE IS RANDOM                  
              RECORD KEY IS ID-COMPTE                
              FILE STATUS IS WS-FILE-STATUS.         
       DATA DIVISION.                                
       FILE SECTION.                                 
       FD  FILECPT.                                  
       01  COMPTE-ENREGISTREMENT.                    
           05 ID-COMPTE            PIC X(6).         
           05 NOM-COMPTE           PIC X(15).        
           05 SOLDE-COMPTE         PIC 9(08).      
           05 REGION-COMPTE        PIC X(10).      
           05 SOLDE-MOYEN          PIC 9(08).      
           05 FILLER               PIC X(33).      
       WORKING-STORAGE SECTION.                    
       01 WS-FILE-STATUS       PIC XX.             
       01 WS-FLAG-FOUND        PIC 9 VALUE 0.      
          88 COMPTE-TROUVE     VALUE 1.            
          88 COMPTE-PAS-TROUVE VALUE 0.            
       01 WS-STATUS-PHYS       PIC XX.             
       01 WS-MESSAGE-ERROR     PIC X(50).          
       LINKAGE SECTION.                            
       01 LS-OPERATION         PIC X(10).          
       01 LS-NUMERO-COMPTE     PIC X(6).           
       01 LS-COMPTE-BUFFER.                        
          05 LS-ID-COMPTE      PIC X(6).           
          05 LS-NOM            PIC X(15).          
          05 LS-SOLDE          PIC 9(08).          
          05 LS-REGION         PIC X(10).          
          05 LS-SOLDE-MOYEN    PIC 9(08).          
          05 FILLER            PIC X(33).                        
       01 LS-STATUS-RET        PIC XX.                           
       PROCEDURE DIVISION USING                                  
           BY REFERENCE LS-OPERATION                             
           BY REFERENCE LS-NUMERO-COMPTE                         
           BY REFERENCE LS-COMPTE-BUFFER                         
           BY REFERENCE LS-STATUS-RET.                           
       DEBUT.                                                    
           EVALUATE LS-OPERATION                                 
              WHEN 'READ'                                        
                 DISPLAY 'DEBUG PHYS - BRANCHE READ ATTEINTE'    
                 PERFORM OP-READ-COMPTE                          
              WHEN 'WRITE'                                       
                 PERFORM OP-WRITE-COMPTE                         
              WHEN 'REWRITE'                                     
                 PERFORM OP-REWRITE-COMPTE                       
              WHEN 'DELETE'                                      
                 PERFORM OP-DELETE-COMPTE                        
              WHEN OTHER                                         
                 DISPLAY 'DEBUG PHYS - WHEN OTHER DECLENCHE !'   
                 MOVE '99' TO WS-STATUS-PHYS                      
                 MOVE 'OPERATION INVALIDE' TO WS-MESSAGE-ERROR    
           END-EVALUATE.                                          
           MOVE WS-STATUS-PHYS TO LS-STATUS-RET                   
           GOBACK.                                                
       OP-READ-COMPTE.                                            
           OPEN INPUT FILECPT.                                    
           IF WS-FILE-STATUS NOT = '00'                           
              MOVE '10' TO WS-STATUS-PHYS                         
              MOVE 'ERREUR OUVERTURE FICHIER' TO WS-MESSAGE-ERROR 
              DISPLAY 'STATUS 10'                                 
           ELSE                                                   
              DISPLAY 'DEBUG PHYS : CORRECT'                      
              MOVE LS-NUMERO-COMPTE TO ID-COMPTE                  
              DISPLAY 'DEBUG PHYS : ID-COMPTE' ID-COMPTE          
              READ FILECPT RECORD                                 
                 INVALID KEY                                      
                   SET COMPTE-PAS-TROUVE TO TRUE                  
                   MOVE '11' TO WS-STATUS-PHYS                    
                   MOVE 'COMPTE NON TROUVE' TO WS-MESSAGE-ERROR   
                   DISPLAY 'DEBUG PHYS - INVALID KEY DECLENCHEE'      
                 NOT INVALID KEY                                      
                   SET COMPTE-TROUVE TO TRUE                          
                   MOVE COMPTE-ENREGISTREMENT TO LS-COMPTE-BUFFER     
                   MOVE '00' TO WS-STATUS-PHYS                        
                   DISPLAY 'DEBUG PHYS - ID   : ' ID-COMPTE           
                   DISPLAY 'DEBUG PHYS - LSID : ' LS-ID-COMPTE        
              END-READ                                                
              CLOSE FILECPT                                           
           END-IF.                                                    
       OP-WRITE-COMPTE.                                               
           OPEN I-O FILECPT.                                          
           IF WS-FILE-STATUS NOT = '00'                               
              MOVE '20' TO WS-STATUS-PHYS                             
              MOVE 'ERREUR OUVERTURE FICHIER' TO WS-MESSAGE-ERROR     
           ELSE                                                       
           MOVE LS-COMPTE-BUFFER TO COMPTE-ENREGISTREMENT             
           WRITE COMPTE-ENREGISTREMENT                                
               INVALID KEY                                            
                   MOVE '21' TO WS-STATUS-PHYS                        
                   MOVE 'COMPTE DEJA EXISTANT' TO WS-MESSAGE-ERROR    
               NOT INVALID KEY                                        
                   MOVE '00' TO WS-STATUS-PHYS                        
           END-WRITE                                                  
           CLOSE FILECPT                                              
           END-IF.                                                    
       OP-REWRITE-COMPTE.                                             
           OPEN I-O FILECPT.                                          
           IF WS-FILE-STATUS NOT = '00'                               
              MOVE '30' TO WS-STATUS-PHYS                             
              MOVE 'ERREUR OUVERTURE FICHIER' TO WS-MESSAGE-ERROR     
           ELSE                                                       
           MOVE LS-COMPTE-BUFFER TO COMPTE-ENREGISTREMENT             
           REWRITE COMPTE-ENREGISTREMENT                              
               INVALID KEY                                            
                   MOVE '31' TO WS-STATUS-PHYS                        
                   MOVE 'COMPTE NON TROUVE' TO WS-MESSAGE-ERROR       
               NOT INVALID KEY                                        
                   MOVE '00' TO WS-STATUS-PHYS                        
           END-REWRITE                                                
           CLOSE FILECPT                                           
           END-IF.                                                 
       OP-DELETE-COMPTE.                                           
           OPEN I-O FILECPT.                                       
           IF WS-FILE-STATUS NOT = '00'                            
              MOVE '40' TO WS-STATUS-PHYS                          
              MOVE 'ERREUR OUVERTURE FICHIER' TO WS-MESSAGE-ERROR  
           ELSE                                                    
           MOVE LS-NUMERO-COMPTE TO ID-COMPTE                      
           DELETE FILECPT                                          
               INVALID KEY                                         
                   MOVE '41' TO WS-STATUS-PHYS                     
                   MOVE 'COMPTE NON TROUVE' TO WS-MESSAGE-ERROR    
               NOT INVALID KEY                                     
                   MOVE '00' TO WS-STATUS-PHYS                     
           END-DELETE                                              
           CLOSE FILECPT                                           
           END-IF.                                                 
