MAPTEST  DFHMSD TYPE=MAP,                                              X
               MODE=INOUT,                                             X
               LANG=COBOL,                                             X
               STORAGE=AUTO,                                           X
               TERM=3270,                                              X
               CTRL=(FREEKB,FRSET),                                    X
               TIOAPFX=YES                                              
MAP1     DFHMDI SIZE=(25,80),                                          X
               LINE=01,                                                X
               COLUMN=01                                                
         DFHMDF POS=(9,23),                                            X
               ATTRB=(ASKIP,NORM),                                     X
               LENGTH=34,                                              X
               INITIAL='WELCOME TO THE MAGIC WORLD IN CICS'             
         DFHMDF POS=(12,27),                                           X
               ATTRB=(ASKIP,NORM),                                     X
               LENGTH=26,                                              X
               INITIAL='MAY THE FORCE BE WITH YOU'                      
MAPTEST  DFHMSD TYPE=FINAL                      
          END 
