IDENTIFICATION DIVISION.                  
PROGRAM-ID. PROGREAD.                     
DATA DIVISION.                            
WORKING-STORAGE SECTION.                  
COPY MAPREAD.                             
01 WS-REC-LEN          PIC S9(4) COMP.    
01 WS-KEY-LEN          PIC S9(4) COMP.    
01 WS-REC-KEY          PIC  X(6).         
                                          
01 WS-COMPTE-LOGIQUE.                     
   05 WS-ID-COMPTE     PIC X(6).          
   05 WS-NOM           PIC X(15).         
   05 WS-SOLDE         PIC 9(08).         
   05 WS-REGION        PIC X(10).         
   05 WS-SOLDE-MOYEN   PIC 9(08).         
   05 FILLER           PIC X(33).         
01 WS-REC-AFF.                            
   05 WS-ID-COMPTE-AFF PIC X(6).          
   05 WS-NOM-AFF       PIC X(15).         
   05 WS-SOLDE-AFF     PIC 9(08).                    
   05 WS-REGION-AFF    PIC X(10).                    
   05 WS-SOLDE-MOYEN-AFF PIC 9(08).                  
PROCEDURE DIVISION.                                  
MAIN-PARA.                                           
    MOVE    80 TO  WS-REC-LEN                        
    MOVE     6 TO  WS-KEY-LEN                        
                                                     
    EXEC CICS SEND MAP('MAP1')                       
         MAPSET('MAPREAD') MAPONLY FREEKB ERASE      
    END-EXEC.                                        
                                                     
    EXEC CICS RECEIVE  MAP('MAP1')                   
         MAPSET('MAPREAD')                           
    END-EXEC.                                        
    MOVE NAMEINI TO WS-REC-KEY.                      
    EXEC CICS READ FILE('FCOMPTE')                   
              INTO  (WS-COMPTE-LOGIQUE)              
              LENGTH(WS-REC-LEN)                     
              RIDFLD(WS-REC-KEY)                     
              KEYLENGTH(WS-KEY-LEN)             
    END-EXEC.                                   
    MOVE WS-ID-COMPTE    TO WS-ID-COMPTE-AFF.   
    MOVE WS-NOM          TO WS-NOM-AFF.         
    MOVE WS-SOLDE        TO WS-SOLDE-AFF.       
    MOVE WS-REGION       TO WS-REGION-AFF.      
    MOVE WS-SOLDE-MOYEN  TO WS-SOLDE-MOYEN-AFF. 
    MOVE WS-REC-AFF      TO NAMEOUTO.           
    EXEC CICS SEND MAP('MAP1')                  
         MAPSET('MAPREAD') DATAONLY FREEKB      
    END-EXEC.                                   
    EXEC CICS                                   
         RETURN                                 
    END-EXEC.                                   
    GOBACK.                                     
